---
kind: method
id: M:Autodesk.Revit.DB.FilterNumericLessOrEqual.#ctor
source: html/14966282-068d-d110-b24f-00eda2bf4811.htm
---
# Autodesk.Revit.DB.FilterNumericLessOrEqual.#ctor Method

Constructs an instance of FilterNumericLessOrEqual.

## Syntax (C#)
```csharp
public FilterNumericLessOrEqual()
```